#  Έξυπνα φώτα

Τα έξυπνα φώτα έχουν ένα αισθητήρα φωτεινότητας(φωτοαντίσταση) που τους επιτρέπει να ανοιγοκλείνουν αυτόματα ανάλογα με το φως που ανιχνεύουν 
στο χώρο.
Το κύκλωμα αποτελείται από ένα τρανζίστορ npn σε συνδεσμολογία κοινού εκπομπού(common emmiter) στη βάση του τρανζίστορ υπάρχει μια τάση που 
αλλάζει ανάλογα με τη φωτεινότητα.Στη βάση έχουμε τοποθετήσει ένα διαιρέτη τάσης η φωτοαντίσταση αυξάνει την αντίσταση της με  το σκοτάδι κ 
έτσι όταν σκοτεινιάζει το ρεύμα που φτάνει στη βάση κάνει το τρανζίστορ να κλείνει και το φως να ανάβει. 
